Revit 2027 API
NavisworksExportOptions.ExportRoomAsAttribute Property
 True to export data for each room converts into a single shared room attribute, false otherwise. Default value is true.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ExportRoomAsAttribute { get; set; }
Public Property ExportRoomAsAttribute As Boolean
	Get
	Set
public:
property bool ExportRoomAsAttribute {
	bool get ();
	void set (bool value);
}
member ExportRoomAsAttribute : bool with get, set
Property Value
Boolean
See Also
Reference
NavisworksExportOptions Class
Autodesk.Revit.DB Namespace